app/views/lists/show.html.erb

<h1> <%= @list.name %> <br> </h1>
<% @list.topics.each do |topic| %> <br>
---
SELECT "topics".* FROM "topics" WHERE "topics"."list_id" = 1