app/views/topics/new.html.erb

SELECT "lists".* FROM "lists"
---
<%= form_for @topic do |f| %>
<p><%= collection_select(:topic, :list_id, List.all, :id, :name) %></p>