app/views/topics/show.html.erb

SELECT "resources".* FROM "resources" WHERE "resources"."topic_id" = 1
---

<% @topic.resources.each do |resource| %>