app/controllers/lists_controller.rb

  def create
    List.create params[:list]
---
INSERT INTO "lists" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 14 Dec 2013 06:30:36 UTC +00:00], ["name", "Ruby Webapps"], ["updated_at", Sat, 14 Dec 2013 06:30:36 UTC +00:00]]

  def index
    # @ratings = current_user.user_topics.map { |user_topic| user_topic.rating }
    @user = current_user
    @user_topics = @user.user_topics.order('created_at ASC')

    @user_topics_with_list_ids = {}
    @user_topics.each do |user_topic|
      list_id = user_topic.topic.list_id
      p list_id
      @user_topics_with_list_ids[user_topic] = list_id
    end
    @lists = List.all
---
SELECT "user_topics".* FROM "user_topics" WHERE "user_topics"."user_id" = 1 AND "user_topics"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "lists".* FROM "lists"