app/controllers/resources_controller.rb

  def create
    @user = User.find(params[:peer_id].to_i)
    if @user.id == current_user.id
      @resource = Resource.create params[:resource]
      @resource.user_id = current_user.id
      @resource.save
      if request.xhr?
        @topic = Topic.find(@resource.topic_id)
---
INSERT INTO "resources" ("content", "created_at", "topic_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "resource"], ["created_at", Sat, 14 Dec 2013 07:35:16 UTC +00:00], ["topic_id", nil], ["updated_at", Sat, 14 Dec 2013 07:35:16 UTC +00:00]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = 1 LIMIT 1