app/controllers/topics_controller.rb

  def create
    new_topic = Topic.create params[:topic]
    User.all.each do |user|
---
INSERT INTO "user_topics" ("created_at", "rating", "topic_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 14 Dec 2013 07:28:14 UTC +00:00], ["rating", 0], ["topic_id", 6], ["updated_at", Sat, 14 Dec 2013 07:28:14 UTC +00:00], ["user_id", 1]]
SELECT "users".* FROM "users"

  def show
    p "#" * 100
    p params
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", "1"]]