app/controllers/user_topics_controller.rb

SELECT "user_topics".* FROM "user_topics" WHERE "user_topics"."id" = $1 LIMIT 1  [["id", "0"]]
UPDATE "user_topics" SET "rating" = 2, "updated_at" = '2013-12-14 08:04:20.708544' WHERE "user_topics"."id" = 0
---
  def update
    @user_topic = UserTopic.find(params[:id])
    @user_topic.rating = params[:new_rating].to_i
    @user_topic.save