app/controllers/users_controller.rb

INSERT INTO "users" ("confirmation_token", "email", "encrypted_password", "firstname", "is_admin", "lastname", "remember_token", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    p params
    User.create(params[:user])